scenarios/scenario.yml
config:
  target: https://chat.allai.build
  phases:
    - name: Grow
      arrivalRate: 1
      duration: 1
  engines:
    playwright:
      defaultTimeout: 120
      navigationTimeout: 120
      launchOptions:
        headless: true
      contextOptions:
        # NOTE: we use the $dirname utility so Playwright can resolve the full path
        storageState: "{{ $dirname }}/storage.json"
  processor: ./flow.js
  variables:
    username: "chat.automation-testing@osf.build"
    password: ""
  # NOTE: add this if you want to run the test in fargate. make sure to remove headless:false too
  # includeFiles:
  #   - ./storage.json

before:
  engine: playwright
  flowFunction: loginUserAndSaveStorage

scenarios:
  - name: create_thread_ask_and_delete
    engine: playwright
    flowFunction: createThreadAndAskQuestionAndDelete