scenarios/scenario_prod.yml
config:
  target: https://chat-test.allai.build/
  phases:
    - name: ramp up
      duration: 2m
      arrivalRate: 1
      rampTo: 1
    # - name: load
    #   duration: 3m
    #   arrivalRate: 2
    #   rampTo: 3
    # - name: sustain
    #   arrivalRate: 3
    #   duration: 5m
  engines:
    playwright:
      launchOptions:
        headless: true
      contextOptions:
        # NOTE: we use the $dirname utility so Playwright can resolve the full path
        storageState: "{{ $dirname }}/storage.json"
  processor: ./flow.js
  variables:
    username: "chat.automation-testing@osf.build"
    password: ""
  # NOTE: add this if you want to run the test in fargate. make sure to remove headless:false too
  includeFiles:
    - ./storage.json

before:
  engine: playwright
  flowFunction: loginUserAndSaveStorage

scenarios:
  - name: go_to_profile_page_and_logout
    engine: playwright
    flowFunction: createThreadAndAskQuestionAndDelete