scenarios/scenario_prod.yml
config:
  target: https://chat.allai.build
  phases:
    - name: start
      duration: 1m
      arrivalRate: 1
    - name: load
      duration: 5m
      arrivalRate: 1
      rampTo: 3
    - name: sustain
      arrivalRate: 3
      duration: 5m
  engines:
    playwright:
      defaultTimeout: 120
      navigationTimeout: 120
      launchOptions:
        headless: true
      contextOptions:
        # NOTE: we use the $dirname utility so Playwright can resolve the full path
        storageState: "{{ $dirname }}/storage.json"
  processor: ./flow.js
  variables:
    username: "chat.automation-testing@osf.build"
    password: ""
  # NOTE: add this if you want to run the test in fargate. make sure to remove headless:false too
  includeFiles:
    - ./storage.json

before:
  engine: playwright
  flowFunction: loginUserAndSaveStorage

scenarios:
  - name: create_thread_ask_and_delete
    engine: playwright
    flowFunction: createThreadAndAskQuestionAndDelete